LEVELS = [
	{
		name: 'Go and get it',
		bu: [2, 5],
		map: [
			'..........',
			'..........',
			'..........',
			'..........',
			'..........',
			'..........',
			'..........',
			'.....$....',
			'..........',
			'..........'
		]
	},
	
	{
		name: 'Like a rock',
		bu: [2, 5],
		map: [
			'..........',
			'..........',
			'..........',
			'..........',
			'..........',
			'.....O....',
			'..........',
			'.....$....',
			'..........',
			'..........'
		]
	},
	
	{
		name: 'Rock Walls',
		bu: [0, 0],
		map: [
			'..........',
			'OOOOOOO...',
			'..........',
			'...OOOOOOO',
			'..........',
			'OOOOOOO...',
			'..........',
			'...OOOOOOO',
			'..........',
			'OOOOOOO..$'
		]
	},

	{
		name: 'Watch out',
		bu: [1, 0],
		map: [
			'..~~~~~~~~',
			'<====~~~~~',
			'..~~|~~~~~',
			'~~~~+===~~',
			'===~~~~|~~',
			'|~+====+~~',
			'|~~~~~~~~~',
			'+..~~.....',
			'..<==>....',
			'...~~....$'
		]
	},

	{
		name: 'Where to go',
		bu: [4, 4],
		map: [
			'#..~~~~~~~',
			'..<==~~..#',
			'~~~~|~~.^.',
			'~~~.+.~~|~',
			'~==>.<==+~',
			'~|~..^~~~~',
			'~|~~~+===~',
			'.+.~~~~~|~',
			'...~~~~.+.',
			'$..~~~~..#'
		]
	},

	{
		name: 'A maze',
		bu: [0, 9],
		map: [
			'.....O....',
			'O.O.$O.OOO',
			'O.O.O.....',
			'...OOO.OO.',
			'.O.O.O.O..',
			'O..O.O.O.O',
			'..O....O..',
			'.OO.O.OOO.',
			'..O.O..#O.',
			'O...OOO...'
		]
	}
];

//载入关卡地图
function Level() {
	setObject();
	xx = LEVELS[level].bu[0];
	yy = LEVELS[level].bu[1];

	bx = LEVELS[level].bu[1]*60;
	by = LEVELS[level].bu[0]*60;
	turn = 0;
	c = s.Front;
	drawBunny();
}

//放置地图元素
function setObject() {
	for(var i = 0; i < LEVELS[level].map.length; i++) {
		for(var j = 0; j < LEVELS[level].map[i].length; j++) {
			mapObject(j, i, LEVELS[level].map[i][j]);
		}
	}
}